# GetHostId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..GetHostId Method
Rebar Class See Also
---
The element that contains the rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public ElementId GetHostId()
```

Visual Basic
---
```text
Public Function GetHostId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetHostId()
```

# ### Return Value
The element that the rebar object belongs to, such as a structural wall, floor, foundation, beam, brace or column.
# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace